docs/math/set-theory.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-04 Sun 18:12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Set Theory</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Set Theory</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdd3206d">1. Overview</a></li>
<li><a href="#orge6868c1">2. Classes</a></li>
<li><a href="#org2407c09">3. References</a>
<ul>
<li><a href="#org8b16af3">3.1. Many-Sorted Models of Sets and Classes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd3206d" class="outline-2">
<h2 id="orgdd3206d"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
A foundation for mathematics, set theory asserts everything may be
encoded using sets (like how on computers everything is encoded using
bits). Although mathematicians believe they use sets as their
foundations, few can really enumerate their axioms. Realistically, it
seems the foundations employed in practice is some amalgam of set theory
equipped with a soft type system, in "$(1+&epsilon;)$-order logic" for
\(0\lt\varepsilon\ll1\).
</p>
</div>
</div>

<div id="outline-container-orge6868c1" class="outline-2">
<h2 id="orge6868c1"><span class="section-number-2">2</span> Classes</h2>
<div class="outline-text-2" id="text-2">
<p>
We might also want to use a "many-sorted logic" to treat proper classes
as a different "sort" than proper sets. Confusingly, this treatment is
referred to as "second-order set theory" in the literature (as opposed
to "two-sorted set theory", which would make more sense).
</p>
</div>
</div>

<div id="outline-container-org2407c09" class="outline-2">
<h2 id="org2407c09"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Thomas Jech, <br>
<cite class="book-title">Set Theory: The Third Millennium Edition</cite>. <br>
Springer, 2003.</li>
<li>Thomas Jech and K. Hrbáček, <br>
<cite class="book-title">Introduction to Set Theory</cite>. <br>
Marcel Dekker, 3rd edition, 1999.</li>
<li>Mike Shulman, <br>
"Set theory for category theory". <br>
<a href="https://arxiv.org/abs/0810.1279">arXiv:0810.1279</a></li>
</ul>
</div>

<div id="outline-container-org8b16af3" class="outline-3">
<h3 id="org8b16af3"><span class="section-number-3">3.1</span> Many-Sorted Models of Sets and Classes</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>V. Gitman,<br>
<a href="https://victoriagitman.github.io/talks/2018/01/03/the-emerging-zoo-of-second-order-set-theories.html">The emerging zoo of second-order set theories</a></li>
<li>Kameryn J Williams, <br>
"The Structure of Models of Second-order Set Theories". <br>
<a href="https://arxiv.org/abs/1804.09526">arXiv:1804.09526</a>, 209 pages.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-03-21 Sun 11:10.</p>
</div>
</body>
</html>